app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE (content LIKE '%fyi%')
---
  def index
    if params[:name]
      @patients = Patient.search(params[:name])

INSERT INTO "patients" ("name", "address", "number", "birthday", "infection", "injury", "observations", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

UPDATE "patients" SET "observations" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["observations", "kevin"], ["updated_at", "2018-04-03 12:08:51.926084"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @patient.update(patient_params)

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 2]]
---
  def destroy
    @patient.destroy